import asyncio
from .config import config
from .utils import send_message

AUTO_MESSAGE = (
    "🦊🍂Мадам Лисичка готова сделать Вас сильнее🍂🦊\n\n"
    "‼️Автобаф, автопост‼️\n\n"
    "⚔️Благословение атаки  — 352 \n"
    "🛡️Благословение защиты — 351 \n"
    "🍀Благословение удачи — 350 \n"
    "☠️Благословение нежити — 349 \n"
    "👺Благословение демона — 348\n"
    "🦸Благословение человека (иногда) — 347\n\n"
    "Шанс крита с колечком 51-52%\n\n"
    "Возможны задержки из-за очереди. При возникновении проблем — в [https://vk.com/lesyalutokvinova|лс]"
)


async def auto_post_loop(session):
    while True:
        try:
            await send_message(
                session=session,
                token=config.token,
                peer_id=config.peer_id,
                message=AUTO_MESSAGE,
                reply_to=None,
            )
            print(f"[AUTOPOST] Сообщение отправлено в чат {config.main_chat_id}")
        except Exception as e:
            print(f"[AUTOPOST] Ошибка отправки: {e}")
        await asyncio.sleep(3 * 60 * 60)  # 3 часа
